; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 5730)
	(= (fuel plane1) 729)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 4)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at person1 city2)
	(at person2 city3)
	(at person3 city2)
	(at person4 city2)
	(at person5 city2)
	(at person6 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 516)
	(= (distance city0 city2) 664)
	(= (distance city0 city3) 845)
	(= (distance city1 city0) 516)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 711)
	(= (distance city1 city3) 603)
	(= (distance city2 city0) 664)
	(= (distance city2 city1) 711)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 625)
	(= (distance city3 city0) 845)
	(= (distance city3 city1) 603)
	(= (distance city3 city2) 625)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city0)
	(at person3 city2)
	(at person4 city2)
	(at person5 city1)
	(at person6 city3)
	))

(:metric minimize (+ (* 2 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (board person5 plane1 city2)
   deleted: (at person5 city2)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 6
2. (refuel plane1 city2)
   changed: (fuel plane1) from 729 to 5730
   goals met: 4 of 6
3. (zoom plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 2500, (fuel plane1) from 5730 to 3230
   goals met: 4 of 6
4. (board person2 plane1 city3)
   deleted: (at person2 city3)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 6
5. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 2500 to 4190, (fuel plane1) from 3230 to 1540
   goals met: 4 of 6
6. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 6
7. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 4190 to 5222, (fuel plane1) from 1540 to 508
   goals met: 5 of 6
8. (debark person5 plane1 city1)
   deleted: (in person5 plane1)
   added: (at person5 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 6
